; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v7 ?v13)
             (pred_9 ?v3 ?v2)
             (pred_3 ?v7 ?v2)
             (pred_1 ?v12 ?v7 )
	     (pred_12 ?v7)
             (pred_11 ?v4)
             (pred_6 ?v3)
             (pred_8 ?v2)
             (pred_5 ?v7)
             (pred_2 ?v3)
             (pred_7 ?v7)
             (pred_10 ))



(:action op_1
:parameters (?v5 ?v10 ?v6 ?v1)
:precondition (and (pred_11 ?v5) (pred_11 ?v10) (pred_6 ?v6) (pred_8 ?v1)
          (pred_4 ?v5 ?v10) (pred_9 ?v6 ?v1)
                   (pred_3 ?v10 ?v1) (pred_12 ?v5) 
                   (pred_5 ?v10) (pred_2 ?v6))
:effect (and  (pred_7 ?v10) (not (pred_5 ?v10))))


(:action op_4
:parameters (?v5 ?v11)
:precondition (and (pred_11 ?v5) (pred_11 ?v11)
               (pred_12 ?v5) (pred_4 ?v5 ?v11) (pred_7 ?v11))
:effect (and (pred_12 ?v11) (not (pred_12 ?v5))))

(:action op_3
:parameters (?v5 ?v6)
:precondition (and (pred_11 ?v5) (pred_6 ?v6) 
                  (pred_12 ?v5) (pred_1 ?v6 ?v5) (pred_10 ))
:effect (and (pred_2 ?v6)
   (not (pred_1 ?v6 ?v5)) (not (pred_10 ))))


(:action op_2
:parameters (?v5 ?v8 ?v9)
:precondition (and (pred_11 ?v5) (pred_6 ?v8) (pred_6 ?v9)
                  (pred_12 ?v5) (pred_2 ?v9) (pred_1 ?v8 ?v5))
:effect (and (pred_2 ?v8) (pred_1 ?v9 ?v5)
        (not (pred_2 ?v9)) (not (pred_1 ?v8 ?v5))))

(:action op_5
:parameters (?v5 ?v6)
:precondition (and (pred_11 ?v5) (pred_6 ?v6) 
                  (pred_12 ?v5) (pred_2 ?v6))
:effect (and (pred_10 ) (pred_1 ?v6 ?v5) (not (pred_2 ?v6)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_21 obj_11 obj_17 obj_04 obj_08 obj_30 obj_06 obj_16 obj_19 obj_27 obj_23 obj_29 obj_09 obj_02 obj_12 obj_10 obj_13 obj_05 obj_26 obj_20 obj_25 obj_22 obj_15 obj_24 obj_28
    obj_18 obj_03 obj_31
    obj_07 obj_01 obj_14 obj_32
    )

    (:init
       (pred_10)

       (pred_11 obj_21)
       (pred_11 obj_11)
       (pred_11 obj_17)
       (pred_11 obj_04)
       (pred_11 obj_08)
       (pred_11 obj_30)
       (pred_11 obj_06)
       (pred_11 obj_16)
       (pred_11 obj_19)
       (pred_11 obj_27)
       (pred_11 obj_23)
       (pred_11 obj_29)
       (pred_11 obj_09)
       (pred_11 obj_02)
       (pred_11 obj_12)
       (pred_11 obj_10)
       (pred_11 obj_13)
       (pred_11 obj_05)
       (pred_11 obj_26)
       (pred_11 obj_20)
       (pred_11 obj_25)
       (pred_11 obj_22)
       (pred_11 obj_15)
       (pred_11 obj_24)
       (pred_11 obj_28)
       (pred_8 obj_18)
       (pred_8 obj_03)
       (pred_8 obj_31)
       (pred_6 obj_07)
       (pred_6 obj_01)
       (pred_6 obj_14)
       (pred_6 obj_32)

       (pred_4 obj_21 obj_30)
       (pred_4 obj_21 obj_11)
       (pred_4 obj_11 obj_06)
       (pred_4 obj_11 obj_17)
       (pred_4 obj_11 obj_21)
       (pred_4 obj_17 obj_16)
       (pred_4 obj_17 obj_04)
       (pred_4 obj_17 obj_11)
       (pred_4 obj_04 obj_19)
       (pred_4 obj_04 obj_08)
       (pred_4 obj_04 obj_17)
       (pred_4 obj_08 obj_27)
       (pred_4 obj_08 obj_04)
       (pred_4 obj_30 obj_23)
       (pred_4 obj_30 obj_06)
       (pred_4 obj_30 obj_21)
       (pred_4 obj_06 obj_29)
       (pred_4 obj_06 obj_16)
       (pred_4 obj_06 obj_11)
       (pred_4 obj_06 obj_30)
       (pred_4 obj_16 obj_09)
       (pred_4 obj_16 obj_19)
       (pred_4 obj_16 obj_17)
       (pred_4 obj_16 obj_06)
       (pred_4 obj_19 obj_02)
       (pred_4 obj_19 obj_27)
       (pred_4 obj_19 obj_04)
       (pred_4 obj_19 obj_16)
       (pred_4 obj_27 obj_12)
       (pred_4 obj_27 obj_08)
       (pred_4 obj_27 obj_19)
       (pred_4 obj_23 obj_10)
       (pred_4 obj_23 obj_29)
       (pred_4 obj_23 obj_30)
       (pred_4 obj_29 obj_13)
       (pred_4 obj_29 obj_09)
       (pred_4 obj_29 obj_06)
       (pred_4 obj_29 obj_23)
       (pred_4 obj_09 obj_05)
       (pred_4 obj_09 obj_02)
       (pred_4 obj_09 obj_16)
       (pred_4 obj_09 obj_29)
       (pred_4 obj_02 obj_26)
       (pred_4 obj_02 obj_12)
       (pred_4 obj_02 obj_19)
       (pred_4 obj_02 obj_09)
       (pred_4 obj_12 obj_20)
       (pred_4 obj_12 obj_27)
       (pred_4 obj_12 obj_02)
       (pred_4 obj_10 obj_25)
       (pred_4 obj_10 obj_13)
       (pred_4 obj_10 obj_23)
       (pred_4 obj_13 obj_22)
       (pred_4 obj_13 obj_05)
       (pred_4 obj_13 obj_29)
       (pred_4 obj_13 obj_10)
       (pred_4 obj_05 obj_15)
       (pred_4 obj_05 obj_26)
       (pred_4 obj_05 obj_09)
       (pred_4 obj_05 obj_13)
       (pred_4 obj_26 obj_24)
       (pred_4 obj_26 obj_20)
       (pred_4 obj_26 obj_02)
       (pred_4 obj_26 obj_05)
       (pred_4 obj_20 obj_28)
       (pred_4 obj_20 obj_12)
       (pred_4 obj_20 obj_26)
       (pred_4 obj_25 obj_22)
       (pred_4 obj_25 obj_10)
       (pred_4 obj_22 obj_15)
       (pred_4 obj_22 obj_13)
       (pred_4 obj_22 obj_25)
       (pred_4 obj_15 obj_24)
       (pred_4 obj_15 obj_05)
       (pred_4 obj_15 obj_22)
       (pred_4 obj_24 obj_28)
       (pred_4 obj_24 obj_26)
       (pred_4 obj_24 obj_15)
       (pred_4 obj_28 obj_20)
       (pred_4 obj_28 obj_24)
       (pred_5 obj_22)
       (pred_5 obj_21)
       (pred_5 obj_24)
       (pred_5 obj_15)
       (pred_3  obj_22 obj_18)
       (pred_3  obj_21 obj_03)
       (pred_3  obj_24 obj_31)
       (pred_3  obj_15 obj_18)
       (pred_7 obj_11)
       (pred_7 obj_17)
       (pred_7 obj_04)
       (pred_7 obj_08)
       (pred_7 obj_30)
       (pred_7 obj_06)
       (pred_7 obj_16)
       (pred_7 obj_19)
       (pred_7 obj_27)
       (pred_7 obj_23)
       (pred_7 obj_29)
       (pred_7 obj_09)
       (pred_7 obj_02)
       (pred_7 obj_12)
       (pred_7 obj_10)
       (pred_7 obj_13)
       (pred_7 obj_05)
       (pred_7 obj_26)
       (pred_7 obj_20)
       (pred_7 obj_25)
       (pred_7 obj_28)

       (pred_9  obj_07 obj_18)
       (pred_9  obj_01 obj_03)
       (pred_9  obj_14 obj_31)
       (pred_9  obj_32 obj_18)
       (pred_1 obj_07 obj_19)
       (pred_1 obj_01 obj_04)
       (pred_1 obj_14 obj_27)
       (pred_1 obj_32 obj_04)
       (pred_12 obj_02)
    )

    (:goal (and
       (pred_1 obj_07 obj_09)
       (pred_1 obj_01 obj_02)
    ))
(:constraints
  (always (not (pred_12 obj_16)))
)
)

; plan
1. (op_4 obj_02 obj_19)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_19)
   goals met: 0 of 2
2. (op_3 obj_19 obj_07)
   deleted: (pred_1 obj_07 obj_19) (pred_10)
   added: (pred_2 obj_07)
   goals met: 0 of 2
3. (op_4 obj_19 obj_04)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_04)
   goals met: 0 of 2
4. (op_2 obj_04 obj_01 obj_07)
   deleted: (pred_2 obj_07) (pred_1 obj_01 obj_04)
   added: (pred_2 obj_01) (pred_1 obj_07 obj_04)
   goals met: 0 of 2
5. (op_4 obj_04 obj_19)
   deleted: (pred_12 obj_04)
   added: (pred_12 obj_19)
   goals met: 0 of 2
6. (op_4 obj_19 obj_02)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_02)
   goals met: 0 of 2
7. (op_5 obj_02 obj_01)
   deleted: (pred_2 obj_01)
   added: (pred_10) (pred_1 obj_01 obj_02)
   goals met: 1 of 2
8. (op_4 obj_02 obj_19)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_19)
   goals met: 1 of 2
9. (op_4 obj_19 obj_04)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_04)
   goals met: 1 of 2
10. (op_3 obj_04 obj_07)
   deleted: (pred_1 obj_07 obj_04) (pred_10)
   added: (pred_2 obj_07)
   goals met: 1 of 2
11. (op_4 obj_04 obj_19)
   deleted: (pred_12 obj_04)
   added: (pred_12 obj_19)
   goals met: 1 of 2
12. (op_4 obj_19 obj_02)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_02)
   goals met: 1 of 2
13. (op_4 obj_02 obj_09)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_09)
   goals met: 1 of 2
14. (op_5 obj_09 obj_07)
   deleted: (pred_2 obj_07)
   added: (pred_10) (pred_1 obj_07 obj_09)
   goals met: 2 of 2
